paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/lookupPaymentResource.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.lookupPaymentResource"> 
   <soapenv:Header/>
   <soapenv:Body>
      <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
      <urn:authorization>Bearer Kz80NhDra9FrIgnhq10GGy-W.5Jz9RP3Rb4bkKclefQ</urn:authorization>
      <urn:id>PAY-5YK922393D847794YKER7MUI</urn:id>
   </soapenv:Body>
</soapenv:Envelope>
